In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
#Create Path
path= r'/Users/shantamaraj/Desktop/INSTACART DATA'

In [4]:
#Import customer csv from Original Data
df = pd.read_csv(os.path.join(path, 'Original Data', 'customers.csv'))

In [5]:
df.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [7]:
df.shape

(206209, 10)

In [9]:
#Rename columns
df = df.rename(columns={ 
    'First Name' : 'first_name',
    'Surnam' : 'last_name', 
    'Gender' : 'gender',
    'STATE' : 'state', 
    'Age' : 'age', 
    'fam_status' : 'family_status'})

In [12]:
df.columns

Index(['user_id', 'first_name', 'last_name', 'gender', 'state', 'age',
       'date_joined', 'n_dependants', 'family_status', 'income'],
      dtype='object')

In [13]:
df.describe()

             user_id            age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [16]:
#find missing values
missing_values = df.isnull().sum()

In [15]:
missing_values

user_id              0
first_name       11259
last_name            0
gender               0
state                0
age                  0
date_joined          0
n_dependants         0
family_status        0
income               0
dtype: int64

In [18]:
# find duplicate rows
duplicates = df.duplicated()
print(duplicates)

0         False
1         False
2         False
3         False
4         False
          ...
206204    False
206205    False
206206    False
206207    False
206208    False
Length: 206209, dtype: bool

In [20]:
#sum the total number of duplicates
number_of_duplicates = duplicates.sum()

In [21]:
number_of_duplicates

0

In [22]:
#no duplicates

In [23]:
# find column types
df.dtypes

user_id           int64
first_name       object
last_name        object
gender           object
state            object
age               int64
date_joined      object
n_dependants      int64
family_status    object
income            int64
dtype: object

## Combining Dataframes

In [24]:
# import dataframe
ords_prods_merge = pd.read_pickle(os.path.join(path, 'Prepared Data', 'orders_products_merged_grouped_4.8.pkl'))

In [25]:
#combine customer with ords_prods_merge
merged_df = pd.merge(ords_prods_merge, df, on='user_id', how='inner')

In [26]:
#check merge
merged_df.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,busiest_period_of_day,first_name,last_name,gender,state,age,date_joined,n_dependants,family_status,income
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,Average orders,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
1,2539329,1,1,2,8,NaN,14084,2,0,Organic Unsweetened Vanilla Almond Milk,...,Average orders,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
2,2539329,1,1,2,8,NaN,12427,3,0,Original Beef Jerky,...,Average orders,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
3,2539329,1,1,2,8,NaN,26088,4,0,Aged White Cheddar Popcorn,...,Average orders,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
4,2539329,1,1,2,8,NaN,26405,5,0,XL Pick-A-Size Paper Towel Rolls,...,Average orders,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423

In [27]:
merged_df.shape

(32434212, 26)

In [30]:
#export merged_df as pickle 
merged_df.to_pickle(os.path.join(path,'Prepared Data', 'ords_prods_customer_merge.pkl'))